<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">
<TITLE>Bedienung des Zahlenhai-Spiels</TITLE>
<link rel="stylesheet" type="text/css" href="CrypTool_Help.css">
</HEAD>

<BODY>
<h3><P><A NAME="zahlenhai"></A><B>Bedienung des Zahlenhai-Spiels</B></P></h3>

<h4><u>1. Die Spielidee</u></h4>

<p>Die Spielidee des Zahlenhais besteht darin, dass Du von den ausw&auml;hlbaren Zahlen m&ouml;glichst viele f&uuml;r Dich gewinnst, so dass deren Summe gr&ouml;&szlig;er ist als die Summe der Zahlen des Zahlenhais und m&ouml;glichst maximal. W&auml;hlst Du eine Zahl, bekommt der Zahlenhai alle noch freien, <a href="NumberSharkRealFactors.html">echten Teiler</a> davon, usw. Die echten Teiler von 6 sind zum Beispiel 1, 2, 3.</p>
<p>Das Spiel lehrt spielerisch den Umgang mit Teilern und <a href="NumberSharkPrimes.html">Primzahlen</a> und wurde urspr&uuml;nglich f&uuml;r Sch&uuml;ler konzipiert.</p>

<P>Im Folgenden wird die Bedienung des Zahlenhai-Spiels anhand der Dialogfenster erl&auml;utert.</P>

<p><h4><u>2. Bedienung des Spiels - Hauptdialogfenster</u></h4></p>

<p>Das Spiel beginnt, indem Du Dir eine Zahl (z.B. 19) ausw&auml;hlst -- der Zahlenhai bekommt dann die echten Teiler (hier die 1) davon. Diese gew&auml;hlte Zahl und deren Teiler werden im Menufeld (Block mit dem Zahlenvorrat) ausgegraut, sie sind nicht mehr ausw&auml;hlbar (nicht mehr frei).</p>
<p>Nachdem Du und der Zahlenhai jeweils einen Zug gemacht haben, geht es folgenderma&szlig;en weiter:</p>
<p>Du nimmst Dir eine neue Zahl und der Zahlenhai bekommt die Teiler -- bis alle Zahlen verteilt sind.<br>
Dein Ziel ist es, dass die Summe Deiner Zahlen gr&ouml;&szlig;er ist als die Summe der Zahlen, die der Zahlenhai frisst.<br><br>
</p>

<P><IMG SRC="Pictures_de/Dlg_main_de.png" ALT="Dlg_main_de.png" BORDER=0 width="91%"></P> 


<P>In der Gruppierung "Einstellungen f&uuml;r ein neues Spiel" kannst Du den Zahlenvorrat bestimmen, also mit wieviel Zahlen Du spielen m&ouml;chtest. Diese Eingabe muss durch den <b>OK</b>-Knopf oder durch die <b>Enter</b>-Taste best&auml;tigt werden. Beim ersten Aufruf des Programms enth&auml;lt dieses Feld den Wert 20.<br>Dr&uuml;ckst Du <b>Neues Spiel</b>, bleibt die zuletzt gew&auml;hlte Zahl stehen. In den Spieloptionen kannst Du festlegen, ob sich das Programm diese Zahl f&uuml;r den n&auml;chsten Programmstart merkt oder nicht.</P>
<p>Wenn Du den <b>OK</b>-Button dr&uuml;ckst, f&uuml;llt sich der Zahlenvorrat mit den Muscheln, die man wie Buttons per Mausklick bedienen kann. Es sind auf dem Block nur maximal 30 Muscheln gleichzeitig sichtbar. Wenn Du Dich f&uuml;r eine Anzahl &uuml;ber 30 entscheidest, erscheinen &uuml;ber dem Block Reiter, &uuml;ber die Du auf 
alle anderen Zahlen-Muscheln zugreifen kannst. Du kannst Dich mit dem Tabulator und mit den Pfeiltasten durch die Zahlen bewegen. Die Zahlen kannst Du auch mit der Enter-Taste oder der Leertaste ausw&auml;hlen.</p>

<P><IMG SRC="Pictures_de/Dlg_main_settings_de.png" ALT="Dlg_main_settings_de.png" BORDER=0 width="91%"></p>

<p>Zur besseren Lesbarkeit werden die Zahlen in allen Muscheln im Zahlenvorrat in gelb dargestellt.</P>

<P>Die Muscheln selbst sind beim Start blau, d.h. Du kannst <b>jede</b> von ihnen ausw&auml;hlen.</P>

<p><IMG SRC="Pictures_de/Dlg_main_shells_de.png" ALT="Dlg_main_shells_de.png" BORDER=0 width="91%"></p>

<P>Jede Zahl, die Du ausgew&auml;hlt hast, und auch jeder Teiler, den der Zahlenhai von dieser Zahl gefunden hat, wird rot gef&auml;rbt. Alle roten Zahlen sind vergeben ("verbraucht" oder "gefressen") und k&ouml;nnen von Dir in den folgenden Z&uuml;gen nicht mehr gew&auml;hlt werden.</P>

<p><IMG SRC="Pictures_de/Dlg_main_shells_use_de.png" ALT="/Dlg_main_shells_use_de.png" BORDER=0 width="91%"></p>

<P>Die Spielverlaufstabelle, die anstelle des Haibilds nach Deiner ersten Auswahl erscheint, zeigt den jeweils aktuellen Punktestand an. Dabei unterteilt sich die Liste in sechs Spalten:<br>
<ul>
	<li>die Nummer der aktuellen Runde,</li>
	<li>die Zahl, welche Du in der jeweiligen Runde gew&auml;hlt und erhalten hast,</li>
	<li>welche Zahlen sich daraufhin der Zahlenhai geschnappt hat,</li>
	<li>Deine aktuelle Gesamtpunktzahl,</li>
	<li>die aktuelle Gesamtpunktzahl des Hais und</li>
	<li>wieviele Zahlen sich noch im Spiel befinden.</li>
</ul>
Die Spalten der Tabellen sind alle in ihrer Breite ver&auml;nderbar, passen sich aber nicht automatisch der maximalen Breite ihres Inhaltes an. Jede Zeile l&auml;sst sich zur besseren Lesbarkeit einzeln markieren.
Wenn der angezeigte Bereich der Liste komplett gef&uuml;llt ist, erscheint am rechten Rand ein Rollbalken (Bl&auml;tterleiste) und der Inhalt der Liste wird nach oben ger&uuml;ckt, damit immer der letzte Eintrag sichtbar ist.</p>

<p>Immer wenn eine <a href="NumberSharkPrimes.html">Primzahl</a> gew&auml;hlt wurde (egal ob von Dir oder vom Zahlenhai), wird in der Spielverlaufstabelle hinter diese Zahl die Markierung "(prim)" geschrieben, um anzuzeigen, dass es sich bei der Zahl um eine Primzahl handelt.</p>

<p><IMG SRC="Pictures_de/Dlg_game_course_de.png" ALT="Dlg_game_course_de.png" BORDER=0 width="91%"></P>
<br>
<p>
<table border="0">
<tr>
	<td><IMG SRC="Pictures_de/Dlg_button_newgame_de.png" ALT=Dlg_button_newgame_de.png" BORDER=0 width="91%"></td>
	<td>Wenn Du auf den Button <b>Neues Spiel</b> dr&uuml;ckst, dann kannst Du jederzeit ein neues Spiel starten. Dabei werden die Spielverlaufstabelle und auch die Muscheln zur&uuml;ckgesetzt. Nur die ausgew&auml;hlte Anzahl an Zahlen, mit der Du das letzte Spiel gespielt hast, bleibt erhalten.</td>
</tr>
<tr>
	<td><p>		<br>		</p></td>
</tr>	
<tr>
	<td><IMG SRC="Pictures_de/Dlg_button_sharkfood_de.png" ALT="Dlg_button_sharkfood_de.png" BORDER=0 width="91%"></td>
	<td>Der Button <b>Haifutter</b> wird immer dann aktiv, wenn es im Spiel Zahlen gibt, die keine Teiler mehr haben und selber auch keine Teiler mehr sind.<br>
		Wenn Du auf diesen Button dr&uuml;ckst, werden alle diese Zahlen dem Zahlenhai sofort zugeschrieben, da der Hai sie auf jeden Fall bekommen w&uuml;rde.</td>
</tr>
<tr>
	<td><p>		<br>		</p></td>
</tr>
<tr>
	<td><IMG SRC="Pictures_de/Dlg_button_options_de.png" ALT="Dlg_button_options_de.png" BORDER=0 width="91%"></td>
	<td>Mit dem Button <b>Weitere M&ouml;glichkeiten</b> &ouml;ffnet sich das Spieloptionen-Fenster, das auch vor dem ersten Aufruf gezeigt wurde.</td>
</tr>
<tr>
	<td><p>		<br>		</p></td>
</tr>
<tr>
	<td><IMG SRC="Pictures_de/Dlg_button_undo_redo_de.png" ALT="Dlg_button_undo_redo_de.png" BORDER=0 width="91%"></td>
<td>Mit dem Button <b>R&uuml;ckw&auml;rts (Undo)</b> kannst Du bereits gespielte Spielz&uuml;ge r&uuml;ckg&auml;ngig machen, um Dich zum Beispiel f&uuml;r eine andere Zahl zu entscheiden.<br> Mit dem Button <b>Vorw&auml;rts (Redo)</b> kannst Du die r&uuml;ckg&auml;ngig gemachten Spielz&uuml;ge solange wieder vorw&auml;rts gehen, solange Du keine &Auml;nderungen im Spielverlauf vornimmst.</td>
</tr>
	
</table>
<p>Nachdem Du auf die erste Zahl (Muschel) gedr&uuml;ckt hast, siehst Du am unteren Ende des Spieldialoges eine Anzeige, die immer den aktuellen Punktstand anzeigt. Auf der linken Seite sind Deine Punkte und auf der rechten die des Zahlenhais.</p>

<p><IMG SRC="Pictures_de/Dlg_led_de.png" ALT="Dlg_led_de.png" BORDER=0 width="91%"></p>

<p>Um die Zahlen auf den Muscheln noch besser lesen zu können, kannst Du während des Spieles mit der Tastenkombination <b>SHIFT+ALT+C</b> die Muscheln ein- und wieder ausblenden. Dies kann auch zu einer schnelleren Darstellung des Spieles führen, falls es bei Dir zu langsam laufen sollte.</p>

<p><IMG SRC="Pictures_de/Dlg_main_noshells_de.png" ALT="Dlg_main_noshells_de.png" BORDER=0></p>

<p><h4><u>3. Spielregeln</u></h4></p>
<table border="0">
<tr>
	<td><IMG SRC="Pictures_de/Dlg_button_help_de.png" ALT="Dlg_button_help_de.png" BORDER=0 width="91%"></td>
	<td>&Uuml;ber den <b>Hilfe</b>-Button kannst Du Dir jederzeit die Online-Hilfe zum Zahlenhai anschauen. Du kannst auch einfach die F1-Taste dr&uuml;cken um die Hilfe aufzurufen</td>
</tr>
<tr>
	<td><p>		<br>		</p></td>
</tr>
<tr>
	<td><IMG SRC="Pictures_de/Dlg_button_rules_de.png" ALT="Dlg_button_rules_de.png" BORDER=0 width="91%"></td>
	<td>&Uuml;ber den Button <b>Spielregeln</b>, am oberen rechten Rand des Spielfensters, erh&auml;ltst Du jederzeit eine kurze Zusammenfassung der Spielregeln.</td>
</tr>
</table>

<P><IMG SRC="Pictures_de/Dlg_rules_de.png" ALT="Dlg_rules_de.png" BORDER=0 width="91%"></p>

<p><h4><u>4. Festlegung der Spieloptionen</u></h4></p>

<p>Zu dem Spieloptionen-Dialog kommt man, indem man im Hauptfenster auf den Button <b>Weitere M&ouml;glichkeiten</b> dr&uuml;ckt.</p>

<p><B>4.1</B>: Im Reiter <b>Willkommen</b> findest Du ein paar kurze Informationen zu dem Zahlenhai Spiel.</p>

<IMG SRC="Pictures_de/Dlg_options1_de.png" ALT="Dlg_options1_de.png" BORDER=0>

<p><B>4.2</B>: Unter dem Reiter <b>Standard</b> hast Du folgende M&ouml;glichkeiten:
<ul>
	<li>Du kannst Deinen Spielernamen eingeben, der am Ende eines Spieles in die Datei <a href="NumberSharkTutorial.html#Zusammenfassung">Zusammenfassung.txt</a> geschrieben wird und der w&auml;hrend des Spiels in der Kopfzeile des Spielfensters sichtbar ist.</li>
	<li>Ist die Checkbox "ToolTips aktivieren" gesetzt, kannst Du Dir w&auml;hrend des Spiels zu allen aktiven Muscheln (diese sind blau gef&auml;rbt) die noch verf&uuml;gbaren Teiler anzeigen lassen. Diese Option sollten nur Anf&auml;nger aktivieren, die noch nicht gut teilen k&ouml;nnen oder die noch keinen Spiel&uuml;berblick haben.</li>
	<li>Mit der Option "Spieloptionen beim n&auml;chsten Programmstart anzeigen" kannst Du Dir aussuchen, ob Du den Spieloptionen-Dialog vor dem n&auml;chsten Programmstart sehen m&ouml;chtest oder nicht.</li>
	<li>Ist der Haken bei "Die zuletzt gew&auml;hlte Anzahl der ausw&auml;hlbaren Zahlen beim n&auml;chsten Programmstart wieder eintragen" gesetzt, merkt sich das Programm diese Zahl f&uuml;r den n&auml;chsten Programmstart.</li>
</ul>
<br>Diese Einstellungen kannst Du jederzeit w&auml;hrend des Spiels &auml;ndern.
</p>

<P><IMG SRC="Pictures_de/Dlg_options2_de.png" ALT="Dlg_options2_de.png" BORDER=0></p>

<p><B>4.3</B>: Unter dem Reiter <b>Maximalwerte</b> kannst Du Dir anzeigen lassen, wie viele Punkte man 
maximal bei welcher Zahlenanzahl n (Zahlenvorrat) bekommen kann.</P>

<P>Die Berechnung dieser optimalen Werte ist mit unserem Brute-Force-Algorithmus schon für Zahlen 
bis 20 sehr rechenintensiv. Wir sch&auml;tzen die Rechendauer der derzeit implementierten 
Brute-Force-Suche für n=23 auf einem 3 GHz PC auf ca. 80 Tage bei 100% CPU-Auslastung. Aber auch mit 
dem neuen Back-Tracking-Algorithmus dauert die Suche ab n=40 über zehn Minuten.</P>

<P>Deshalb wurden die Ergebnisse bis n=158 vorberechnet. Ist der Radiobutton <B>Die maximal mögliche 
Punktzahl anzeigen</B> ausgewählt, erscheint das Ergebnis nach einem Klick auf den Button <B>Start</B> 
sofort.</P>

<P>Neben der <a href="NumberSharkDevelopment.html#Berechnung">maximal m&ouml;glichen Punktzahl</a> 
wird auch noch mit ausgegeben, welche Zahlen Du in welcher Reihenfolge dr&uuml;cken solltest, um diese 
maximale Punktzahl zu erreichen. Dieser optimale <B>Weg</B> ist nicht immer eindeutig, oft k&ouml;nnen 
einzelne direkt aufeinander folgende Zahlen in der Reihenfolge der Auswahl miteinander vertauscht 
werden (es gibt keine eindeutige Lösung). Zus&auml;tzlich erh&auml;lt man noch einen Tipp, mit welcher 
Zahl man das Spiel beginnen muss, um m&ouml;glichst viele Punkte zu erreichen.</p>

<P><IMG SRC="Pictures_de/Dlg_options4_de.png" ALT="Dlg_options4_de.png" BORDER=0></p>

<P><B>4.4</B>: Unter dem Reiter <B>Tastenkombinationen</B> werden die implementierten 
Tastenkombinationen dargestellt.</P>

<br><br>

<p>Wenn Du N&auml;heres zur Entstehungsgeschichte des Zahlenhai-Spieles erfahren willst, klicke <a href="NumberSharkDevelopment.html">hier</a>.</p>


<p>Aus rechtlichen Gr&uuml;nden m&uuml;ssen wir explizit auf <a href="NumberSharkLicense.html">Lizenzbestimmungen / Haftungsausschluss</a> hinweisen.</p>
</BODY>
</HTML> 
