<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">
<HTML>
<HEAD>
<meta name="GENERATOR" content="Microsoft&reg; HTML Help Workshop 4.1">
<Title>Entstehung des Zahlenhai-Spiels</Title>
<link rel="stylesheet" type="text/css" href="CrypTool_Help.css">
</HEAD>
<BODY>
<h3><P><A NAME="entstehung"></A><B>Entstehung des Zahlenhai-Spiels</B></P></h3>

<p>Die Idee zum Zahlenhai-Spiel stammt von Herrn Lothar Carl, der auch die urspr&uuml;ngliche
Version in Delphi programmierte. Das Zahlenhai-Spiel dient zur Verbesserung und zum
spielerischen Training der Kenntnisse &uuml;ber Teilbarkeiten und über Primzahlen
in den Klassen 6 bis 10.</p>

<p>Das Original-Zahlenhai-Spiel von Herrn Carl war Freeware, aber nicht Open-Source.<br>
Leider ist es nicht mehr zugänglich: 
<a href="http://archive.is/djxT9" target="_blank">http://archive.is/djxT9</a></p>
<!-- Kommentar:
<a href="http://www.learn-line.nrw.de/angebote/neuemedien/medio/mathe/coalgebr/zahlhai/hai01.htm" target="_blank">http://www.learn-line.nrw.de/angebote/neuemedien/medio/mathe/coalgebr/zahlhai/hai01.htm</a></p>
  -->

<!-- Kommentar:
<P>Auf der Seite von Herrn Carl stehen die für den Spieler maximal erreichbaren Punktzahlen für 
Zahlenvorr&auml;te bis n=50. Das sind allerdings erspielte Werte, so dass sich die Ergebnisse noch 
&auml;ndern k&ouml;nnen (die letzte Änderung der Seite datiert auf den 12.10.2000).</P>
  -->

<P>Herr Carl hat uns dankenswerterweise erlaubt, seine Idee und seinen Spielnamen f&uuml;r eine 
Neuimplementierung uneingeschr&auml;nkt zu nutzen. Das nachfolgende Bild zeigt die 
urspr&uuml;ngliche Fassung des Zahlenhai-Spiels:</P>

<IMG SRC="Pictures_de/game_original_de.png" ALT="game_original_de.png" BORDER=0>

<IMG SRC="Pictures_de/hai.gif" ALT="hai.gif" BORDER=0>

<P>Das neue Zahlenhai-Programm hier ist Open-Source und Freeware.</P>

<P>Im Englischen heißt diese Spielidee bezeichnenderweise "Taxman".</P>

<P>Die Seite <a href="https://oeis.org/A019312" target="_blank">https://oeis.org/A019312</a> 
der <b>Integer Sequences</b> enthält die bekannten Maximalwerte. Dort kann die Folge auch 
gleich grafisch angezeigt werden. Bei der ATT Integer Sequence ist - dank Dan Hoey - inzwischen in den 
"Notes" auch der optimale Weg angegeben. Eine Formel für den optimalen Wert ist bisher nicht bekannt.</P>

<P>Alle bisher bekannten Verfahren zur Berechnung des optimalen Weges benötigen für große Werte von n 
<B>sehr</B> lange. Im neuen Java-CrypTool sind heuristische Verfahren implementiert, die gute -- aber nicht unbedingt optimale Wege -- suchen. Diese Verfahren sind sehr schnell.</P>

<P>Im März 2015 wurde die Folge der Maximalwerte ausgedehnt bis n=404.</P>
<P>(Stand: Februar 2017)</P>
	

<p><b><u>1. Programmieren lernen</u></b></p>

<p>Innerhalb der Ausbildung im 1. Lehrjahr zum Fachinformatiker wurde die Idee von Herrn Carl als Vorlage gew&auml;hlt, um Programmierkenntnisse in C++ zu vermitteln und diese Kenntnisse sp&auml;ter durch Erweiterungen des Programms zu vertiefen.</p>

<p>Zuerst wurde das Verfahren des Zahlenhai-Spiels in C++ als "Konsolenprogramm" implementiert (Konsolenprogramme machen nur eine  Textein- und -ausgabe. Sie werden von der Kommandozeile gestartet: Unter Windows ist das Kommandozeilenfenster sehr versteckt: siehe Start \ Alle Programme \ Zubeh&ouml;r \ Eingabeaufforderung).</p>

<p><IMG SRC="Pictures_de/console_de.png" ALT="console_de.png" BORDER=0 width="91%"></p>

<p>Erst als die Logik des Algorithmus korrekt implementiert war, wurde eine grafische Oberfl&auml;che erstellt.</p>

<p>Danach wurde das Programm stetig erweitert: <a name="Buttons">Die</a> erste Erweiterung bestand darin, das Spiel mit mehr als 50 Zahlen spielen zu k&ouml;nnen (50 Zahlen waren die Obergrenze in dem Spiel von Herrn Carl). Daf&uuml;r wurde ein Reiter-Control (Tab) verwendet, auf dem sich 30 Buttons befinden, die je nach ausgew&auml;hltem Reiter ihre Beschriftung und somit auch ihren Wert &auml;ndern.<br>
Dadurch wurde die maximal m&ouml;gliche Anzahl an Zahlen auf 9999 erh&ouml;ht. Die Grenze ist im Quellcode so vorgegeben und ist bedingt durch die Gr&ouml;&szlig;e der Buttons und der Reiter. Es w&auml;re auch nicht sinnvoll, mit noch mehr Zahlen zu spielen, da man bei so einer Menge gleichzeitig sehr viele Teiler von sehr vielen Zahlen ber&uuml;cksichtigen muss und dadurch auch schnell den &Uuml;berblick &uuml;ber das Spiel verliert.</p>
<p>Das Spielfenster und alle Teile darin haben eine feste Gr&ouml;&szlig;e. Wir h&auml;tten gern das Fenster wenigstens in vertikaler Richtung  so gr&ouml;&szlig;enver&auml;nderlich gemacht, dass sich die Spielverlaufstabelle entsprechend anpasst, leider bot uns der Layout-Manager im Ressourceneditor von Visual C++ 6.0 und Visual C++ 7.1 (Visual Studio 2003) keine M&ouml;glichkeit f&uuml;r das so genannte "Andocken" von grafischen Elementen an die Dialogmasken. Nur die Spalten der Spielverlaufstabelle sind in ihrer Breite ver&auml;nderbar, damit sich der Spieler wirklich alle Punkte, die der Zahlenhai erhalten hat, anschauen kann. Die Spalten passen sich aber nicht automatisch ihrem Inhalt an. Die Größenveränderlichkeit wäre eine gute Aufgabe für eine zukünftige Version, die den Grafikmechanismus WPF von Windows 7 benutzt (siehe <a href="#TODOLIST">TODO #16</a> unten in Kapitel 7 dieser Onlinehilfe-Seite).</p>

<p><IMG SRC="Pictures_de/Dlg_limit_de.png" ALT="Dlg_limit_de.png" BORDER=0 width="91%"></p>


<p><b><u>2. Maximal erreichbare Punktzahl ausgeben</u></b></p>

<p>W&auml;hrend des Testens kam mehrfach die Frage auf, wie viel Punkte der Spieler maximal erreichen 
kann. Um dies zu beantworten, wurde eine Funktion geschrieben, die die maximal erreichbare Punktzahl 
ausrechnet. Dr&uuml;ckt man auf den Button <b>Start</b>, welcher sich in dem "Spieloptionen"-Fenster 
(Reiter "Maximale Punktzahl") befindet, kann man zwischen zwei Algorithmen wählen:</p>

<p><B>Brute-Force-Algorithmus</B>: <a name="Berechnung">Die</a> hier implementierte Berechnung 
l&auml;sst das Programm jedes m&ouml;gliche Spiel und jeden m&ouml;glichen Spielzug spielen und die 
erreichten Punkte vergleichen.</P>

<P><B>Back-Tracking-Algorithmus</B>: Der Algorithmus arbeitet nach dem Versuch-und-Irrtum-Prinzip; 
Teillösungen werden Schritt für Schritt zu einer Gesamtlösung zusammengesetzt. Weitere Informationen 
zu Back-Tracking-Algorithmen findest Du <a href="http://de.wikipedia.org/wiki/Backtracking" target="_blank">hier</a>.</P>

<P>Nach der Auswahl des Algorithmus erhält man:</P>

<ul>
	<li>die maximal erreichbare Punktzahl,</li>
	<li>die Zeit, die f&uuml;r die Berechnung ben&ouml;tigt wurde,</li>
	<li>die Anzahl der Schritte, die das Programm durchlaufen musste, um das Ergebnis zu berechnen,</li>
	<li>die h&ouml;chste Primzahl (die Du als erste Zahl ausw&auml;hlen solltest), und</li>
	<li>die Zahlenfolge, die das Programm berechnete, um die maximal m&ouml;gliche Punktzahl zu erreichen.</li>
</ul>



<p><IMG SRC="Pictures_de/Dlg_options4_de.PNG" ALT="Dlg_options4_de.PNG" BORDER=0 width="91%"></p>

</p>
<p>Da die Berechnung f&uuml;r eine gr&ouml;&szlig;ere Anzahl an Zahlen sehr lange dauert, wird der Spieler vorher gefragt, ob diese Funktion wirklich ausgef&uuml;hrt werden soll.</p>

<p><IMG SRC="Pictures_de/Dlg_max_warn_de.png" ALT="Dlg_max_warn_de.png" BORDER=0 width="91%"></p>

<p><IMG SRC="Pictures_de/Dlg_max_value_de.png" ALT="Dlg_max_new_de.png" BORDER=0 width="91%"></p>

<p><u><b>Bemerkung</b></u>:</p>
<p>Die maximal m&ouml;glichen Punktzahlen sind f&uuml;r die Zahlenvorr&auml;te von 1 bis 158 schon in der Datei "GameData.txt" abgelegt und m&uuml;ssen nicht noch einmal berechnet werden, sondern können auch sofort ausgegeben werden.</p>

<p><IMG SRC="Pictures_de/Dlg_max_old_de.png" ALT="Dlg_max_old_de.png" BORDER=0 width="91%"></p>

<p>Au&szlig;erdem kann sich der Spieler auch noch einen optimalen Weg (also die Folge der Zahlen, die zur maximalen Punktzahl f&uuml;hrt) anzeigen lassen.</p>

<p><IMG SRC="Pictures_de/Dlg_max_way_de.png" ALT="Dlg_max_way_de.png" BORDER=0 width="91%"></p>


<p><b><u>3. Durchf&uuml;hrung und Wiederaufsetzten bei &uuml;berlangen Berechnungen</u></b></p>
<p>Da die Berechnung der maximal m&ouml;glichen Punkte bei gr&ouml;&szlig;eren Zahlen mit unserem Brute-Force-Algorithmus extrem lange dauert, musste ein Weg gefunden werden, um die Berechnung der Zahlen unterbrechen und zu einem sp&auml;teren Zeitpunkt wieder fortsetzen zu k&ouml;nnen (z.B. weil der Strom ausfiel oder man den Rechner f&uuml;r andere Aufgaben brauchte). Dazu werden alle f&uuml;r die Berechnung ben&ouml;tigten Zwischenwerte in geringen Zeitabst&auml;nden in einer Textdatei gespeichert. Die Datei "ZahlenHaiSuche[Anzahl der Zahlen].zha" wird in demselben Ordner gespeichert, in dem sich auch die Datei "Zahlenhai.exe" befindet. Sie l&auml;sst sich mit einem Texteditor &ouml;ffnen und anschauen.</p> 

<p><IMG SRC="Pictures_de/game_max_calc.png" ALT="game_max_calc.png" BORDER=0 width="91%"></p>

<p>Wenn jetzt eine neue Berechnung der maximalen Punktzahl gestartet wird, schaut das Programm erst, ob schon eine Datei mit gespeicherten Werten existiert, liest diese ein und setzt dann die Suche an der eingelesenen Stelle fort. Auch ohne Wissen dar&uuml;ber, was f&uuml;r Werte in der Datei gespeichert werden und wie die Brute-Force-Suche funktioniert, kannst Du, einen schnellen Rechner und viel Zeit vorausgesetzt, auch selbst neue Werte berechnen.</p>

<p><u><b>Bemerkung</b></u>:</p>
<p>Unter den beiden Algorithmen, die das optimale Ergebnis suchen (Brute-Force und Back-Tracking), ist das Wiederaufsetzen auf Zwischenergebnisse nur für das Brute-Force-Verfahren implementiert.</p>

<p>F&uuml;r Zahlen &gt; 158 bitten wir um Deine Mithilfe: siehe <a href="NumberSharkChallenge.html">Challenge</a>. Wenn Du f&uuml;r Zahlen &gt; 158 eine maximale Punktzahl und einen optimalen Weg gefunden hast, w&uuml;rden wir uns sehr freuen, wenn Du diese Ergebnisse dann an bernhard.esslinger@uni-siegen.de sendest.</p>


<p><b><u>4. Programmsteuerung</u></b></p>

<p>a) Auswahl der Zahlen im Muschelfeld</p>
<p>Um die Benutzerfreundlichkeit in dem Programm zu erh&ouml;hen, wurde auch noch eine reine Tastatursteuerung implementiert: Damit kann sich der Benutzer mit den Pfeiltasten (links, rechts, hoch, runter) frei auf den mit Zahlen beschrifteten Muscheln, sowie den dazugeh&ouml;rigen Reitern, bewegen. In früheren Versionen konnte man sich nur mit den Pfeiltasten links und rechts, sowie mit der Tabulator-Taste bewegen sowie mit der Leertaste eine Zahl auswählen. Ausw&auml;hlen kann man die Zahlen dann mit der <B>Enter-</B> oder der <B>Leertaste</B>.</p>
<p>b) R&uuml;ckg&auml;ngig machen und wieder Vorw&auml;rts-Gehen mit den Undo- und Redo-Buttons</p>
<p>Im Zahlenhai kannst Du &uuml;ber den <b>R&uuml;ckw&auml;rts</b>-Button (Undo) <IMG SRC="Pictures_de/Dlg_main_undo.png" ALT="Dlg_main_undo.png" BORDER=0> bereits gespielte Spielz&uuml;ge r&uuml;ckg&auml;ngig machen, um Dich f&uuml;r eine andere Zahl zu entscheiden. Mit dem <b>Vorw&auml;rts</b>-Button (Redo) <IMG SRC="Pictures_de/Dlg_main_redo.png" ALT="Dlg_main_redo.png" BORDER=0> kannst Du Deine zur&uuml;ck genommenen Spielz&uuml;ge auch wieder vorw&auml;rts gehen, solange Du keine &Auml;nderungen im Spielverlauf vorgenommen hast.</p>


<p><b><u>5. Tests</u></b></p>

<p>An den Tests des Programms waren neben den Mitarbeitern aus der Abteilung und einigen Auszubildenden auch Test-User im Internet beteiligt. Dadurch ergaben sich viele praktische Vorschläge zur Verbesserung des Programms wie zum Beispiel die ToolTips, die Steuerung &uuml;ber die Tastatur oder das Durchf&uuml;hren langer Berechnungen durch Wiederaufsetzen.

Später kamen von verschiedenen Seiten interessante Untersuchungen zum zugrundeliegenden zahlentheoretischen Problem
zusammen.</p>


<p><b><u>6. Optische Gestaltung</u></b></p>

<p>Damit das Programm mehr wie ein Spiel und weniger wie eine normale B&uuml;roanwendung aussieht, musste auch die optische Aufmachung des Spieles verbessert werden. Der erste Schritt zu einer besseren optischen Gestaltung war die Ver&auml;nderung der Buttons f&uuml;r den Zahlenvorrat. Daf&uuml;r wurde das Bild einer Muschel entsprechend den verschiedenen Zust&auml;nden eines Buttons, also "gedr&uuml;ckt", "deaktiviert" oder "Focus", verändert. Die Buttons an sich wurden transparent gemacht, so dass es so aussieht, als w&auml;ren die R&auml;nder der Muschel auch der Rand des Buttons.</p>

<p>Du kannst die Muscheln jederzeit w&auml;hrend des Spieles durch einfache Buttons ersetzen. Daf&uuml;r brauchst Du nur die Tastenkombination <b>SHIFT+ALT+C</b> auf Deiner Tastatur dr&uuml;cken. Die Zahlen auf den einfachen Buttons sind (für manche Menschen) besser lesbar. Erneutes Drücken von <b>SHIFT+ALT+C</b> zeigt wieder die Muscheldarstellung.</p>

<p>Verschiedene Haifisch-Bilder wurden in das Spielfenster eingef&uuml;gt; und jedes Mal,
wenn Du den Button <b>Neues Spiel</b> drückst, erscheint ein neues Bild.</p>

<p>Bei den Muschel-Bildern wurde die Schriftfarbe an die Farbe der Bilder angepasst.
Zus&auml;tzlich wurde die Spielverlaufstabelle in den Farben der Muscheln eingef&auml;rbt.</p>

<P>Dann wurden die normalen rechteckigen ToolTips über den Muscheln durch abgerundete
Fenster, so genannte Balloon-Tips, ersetzt.</p>

<p>Um den Dialog noch mehr wie ein Spiel aussehen zu lassen, wurde ein Dialogfeld, das aussieht wie eine LED-Anzeige, hinzugef&uuml;gt: W&auml;hrend des Spiels zeigt dieses gro&szlig; den Punktestand an.</p>

<p>Die Optionen wurden auf die Reiter <B>Willkommen</B>, <B>Standard</B>,
<B>Maximale Punktzahl</B> und <B>Tastenkombinationen</B> verteilt, so dass jede Optionen-Art f&uuml;r sich alleine steht. In dem Reiter <B>Farben</B> soll man sp&auml;ter noch die M&ouml;glichkeit haben, sich die Farben der Tabelle und die Schriftfarben, &auml;hnlich wie bei MS Paint, selber auszusuchen (siehe <a href="#TODOLIST">TODO #5</a>).<p>

<p>Bei der Gestaltung der Buttons f&uuml;r den Zahlenvorrat, der LED-Anzeige und
der farbigen Darstellung der Spielverlaufstabelle wurde auf Quellcodebeispiele
von <a href="http://www.codeproject.com" 
target="_blank">http://www.codeproject.com</a> zurückgegriffen.</p> 



<p><a name="TODOLIST"></a><b><u>7. TODOs</u> - Wie man das Programm weiter verbessern kann.</b></p>

<p>Das Zahlenhai-Programm kann nat&uuml;rlich noch weiterentwickelt werden. Vorschl&auml;ge f&uuml;r eine Version 2.0 sind:
<ol type =1>
	<li>Eine gro&szlig;e Aufgabe, die sich noch stellt, ist es, schnellere M&ouml;glichkeiten zu finden, die maximal m&ouml;gliche (optimale) Punktzahl und den Weg dahin zu berechnen (siehe <a href="NumberSharkChallenge.html">Challenge</a>).<br/>
	Ein erster großer Fortschritt wurde mit dem Back-Tracking-Algorithmus erzielt [dabei wird im Prinzip auch eine vollständige Suche durchgeführt -- mit Ausschluss möglichst vieler (Teil-)Lösungen]. Dieser Back-Tracking-Algorithmus 
	wurde uns freundlicherweise von Herrn Dr. Jens Liebehenschel, metio GmbH, zur Verfügung gestellt.</li>
	<li>Au&szlig;erdem gibt es viele M&ouml;glichkeiten, das Programm bunter und spielerischer aussehen zu lassen.</li>
	<li>Wenn sich der Mauszeiger über einer noch auswählbaren blauen Muschel befindet, also einer blauen, dann soll sich er sich zum Beispiel in eine Hand verwandeln.</li>
	<li>Eine animierte Muschel schluckt die Zahlen, wenn sie an den Zahlenhai gehen.</li>
	<li>Eine Farbauswahlpalette, &auml;hnlich MS Paint, in die Optionen integrieren (Optionen-Reiter Farbe).</li>
	<li>Sliderbox zur Auswahl der Zahlenvorratsgr&ouml;&szlig;e (in JavaCrypTool bereits implementiert).</li>
	<li>Eine Highscore-Tabelle anzeigen (dies gibt es in CrypTool-Online
	unter <a href="http://cryptool-online.org/index.php/de/highlights/taxman"
		target="_blank">http://cryptool-online.org/index.php/de/highlights/taxman</a>).</li>
	<li>Es soll m&ouml;glich sein, dass sich der Spieler aussuchen kann, wie viele Buttons er auf einmal im Tab-Control sehen m&ouml;chte (20, 30 oder 40).</li>
	<li>Da sich die Spalten der Spielverlaufstabelle nicht automatisch ihrem Inhalt anpassen, sondern der Benutzer dies selber machen muss, soll es auch eine M&ouml;glichkeit f&uuml;r den Benutzer geben, die Spalten wieder auf ihre Ursprungsbreite zur&uuml;ck zu setzen.</li>
	<li>Eine weitere Spielm&ouml;glichkeit f&uuml;r das Programm w&auml;re, dass Spieler und Zahlenhai die Rollen tauschen.</li>
	<li>Zeilen aus der Spielverlaufstabelle markieren und in ein Clipboard kopieren k&ouml;nnen.</li>
	<li>Batch-Aufruf mit allen n&ouml;tigen Eingaben (Name, Anzahl, Eingabezahlen, Outputdateiname). Damit k&ouml;nnte man herausfinden, wieviele Punkte man durchschnittlich erh&auml;lt, wenn die Muscheln willk&uuml;rlich gedr&uuml;ckt werden. Ein Benutzer könnte auch eine Folge von Zahlen direkt eingeben, und das Programm berechnet den zugehörigen Wert.</li>
	<li>Eine Idee w&auml;re auch noch, dass man das Spiel nicht mit einem Zahlenvorrat von 1 bis n startet, sondern zum Beispiel von 5 bis n (den kleinsten Wert ändern).</li>
	<li>Wenn man brute-force optimale Werte f&uuml;r n &gt; 158 berechnen l&auml;sst, sollte<br>
	<ol type = "a">
		<li>diese Task abzubrechen sein (Multithreading).</li>
		<li>es möglich sein, während der Berechnung weiterzuspielen.</li>
		<li>man aus der Datei *.zha die besten, bisher gefundenen Werte auslesen k&ouml;nnen.</li>
	</ol>
	</li>
	<li>Zwischen-/Spielstand speichern und wieder aufsetzen (erledigt für
            den Brute-Force-Algorithmus). Dokumentieren für Entwickler, wie das
	    Wiederaufsetzen zu implementieren ist.</li>
	<li>In der Dialogbox "Spielregeln/Spielbeschreibung" (nicht Onlinehilfe)
	    den Hintergrund weiß und die Überschriften größer machen.</li>
        <li>In der Dialogbox "Spieloptionen" unter dem Reiter "Willkommen"
	    die Zeile "Grips-Spiel" zentrieren und größerer Font.</li>
	<li>Auf WPF portieren und dann die Dialogbox in der Höhe
            größenveränderbar machen (Andocken der Controls).</li>
        <LI>Eine Funktion implementieren, die die Haifutterzahlen immer sofort
	    verteilt, ohne dass der Benutzer eingreifen muss.</LI>
</ol>
</p>

<p>Allgemeine Hinweise zur Benutzeroberfl&auml;che findest Du <a href="NumberShark.html">hier</a>. Und Tipps zum Spielverlauf findest Du <a href="NumberSharkTutorial.html">hier</a>.</p>

<p>Aus rechtlichen Gr&uuml;nden m&uuml;ssen wir explizit auf <a href="NumberSharkLicense.html">Lizenzbestimmungen / Haftungsausschluss</a> hinweisen.</p>
<br />

</BODY>
</HTML>

